export const discussions = [
  {
    comment: `Лорем ипсум е едноставен модел на текст кој се користел во
      печатарската индустрија. Лорем ипсум бил индустриски стандард
      кој се користел како модел уште пред 1500 години, кога непознат
      печатар зел кутија со букви и ги сложил на таков начин за да
      направи примерок на книга. И не само што овој модел опстанал пет
      векови туку почнал да се користи и во електронските медиуми, кој
      се уште не е променет. Се популаризирал во 60-тите години на
      дваесеттиот век со издавањето на збирка од страни во кои се
      наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како
      што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.`,
    img: "./images/360_F_299042079_vGBD7wIlSeNl7vOevWHiL93G4koMM967.jpg",
    name: "John Doe",
    date: "00/00/00, 00:00",
  },
  {
    comment: `Лорем ипсум е едноставен модел на текст кој се користел во
      печатарската индустрија. Лорем ипсум бил индустриски стандард
      кој се користел како модел уште пред 1500 години, кога непознат
      печатар зел кутија со букви и ги сложил на таков начин за да
      направи примерок на книга. И не само што овој модел опстанал пет
      векови туку почнал да се користи и во електронските медиуми, кој
      се уште не е променет.`,
    img: "./images/360_F_299042079_vGBD7wIlSeNl7vOevWHiL93G4koMM967.jpg",
    name: "John Doe",
    date: "00/00/00, 00:00",
  },
  {
    comment: `Лорем ипсум е едноставен модел на текст кој се користел во
      печатарската индустрија. Лорем ипсум бил индустриски стандард
      кој се користел како модел уште пред 1500 години, кога непознат
      печатар зел кутија со букви и ги сложил на таков начин за да
      направи примерок на книга. И не само што овој модел опстанал пет
      векови туку почнал да се користи и во електронските медиуми, кој
      се уште не е променет. Се популаризирал во 60-тите години на
      дваесеттиот век со издавањето на збирка од страни во кои се
      наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како
      што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.`,
    img: "./images/360_F_299042079_vGBD7wIlSeNl7vOevWHiL93G4koMM967.jpg",
    name: "John Doe",
    date: "00/00/00, 00:00",
  },
  {
    comment: `Лорем ипсум е едноставен модел на текст кој се користел во
      печатарската индустрија. Лорем ипсум бил индустриски стандард
      кој се користел како модел уште пред 1500 години, кога непознат
      печатар зел кутија со букви и ги сложил на таков начин за да
      направи примерок на книга.`,
    img: "./images/360_F_299042079_vGBD7wIlSeNl7vOevWHiL93G4koMM967.jpg",
    name: "John Doe",
    date: "00/00/00, 00:00",
  },
  {
    comment: `Лорем ипсум е едноставен модел на текст кој се користел во
      печатарската индустрија. Лорем ипсум бил индустриски стандард
      кој се користел како модел уште пред 1500 години, кога непознат
      печатар зел кутија со букви и ги сложил на таков начин за да
      направи примерок на книга.`,
    img: "./images/360_F_299042079_vGBD7wIlSeNl7vOevWHiL93G4koMM967.jpg",
    name: "John Doe",
    date: "00/00/00, 00:00",
  },
  {
    comment: `Лорем ипсум е едноставен модел на текст кој се користел во
      печатарската индустрија. Лорем ипсум бил индустриски стандард
      кој се користел како модел уште пред 1500 години.`,
    img: "./images/360_F_299042079_vGBD7wIlSeNl7vOevWHiL93G4koMM967.jpg",
    name: "John Doe",
    date: "00/00/00, 00:00",
  },
];

export const users = [
  {
    username: "User123",
    email: "user123@example.com",
    password: "Pass123",
    yearOfBirth: "2000",
    gender: "машки",
    imgBig: "./images/d519af300746bf204120977cb2c6f3ce.png",
    imgSmall: "./images/a0af269d50ae5839bea6f9f57815303c.jpg",
    savedFilters: [],
    videoCounter: 0,
    joinInBadge: false,
    videoBadge: false,
    activityBadge: false,
  },
  {
    username: "User456",
    email: "user456@example.com",
    password: "Pass456",
    yearOfBirth: "2000",
    gender: "машки",
    imgBig: "./images/360_F_214746128_31JkeaP6rU0NzzzdFC4khGkmqc8noe6h.jpg",
    imgSmall: "./images/360_F_214746128_31JkeaP6rU0NzzzdFC4khGkmqc8noe6h.jpg",
    savedFilters: [],
    videoCounter: 0,
    joinInBadge: false,
    videoBadge: false,
    activityBadge: false,
  },
  {
    username: "User789",
    email: "user789@example.com",
    password: "Pass789",
    yearOfBirth: "2000",
    gender: "машки",
    imgBig: "./images/360_F_215634201_6MHT39zdmOmAmbbWLth2z7KMvpiZnMak.jpg",
    imgSmall: "./images/360_F_215634201_6MHT39zdmOmAmbbWLth2z7KMvpiZnMak.jpg",
    savedFilters: [],
    videoCounter: 0,
    joinInBadge: false,
    videoBadge: false,
    activityBadge: false,
  },
];

export const contentItems = [
  {
    id: "1",
    heading: "Картица 1",
    descriptionShort:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард...",
    descriptionLong:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "28/05/23",
    image: "./images/image1.jpg",
    video: "./videos/Jack Harlow - First Class.mp4",
    comments: [
      {
        author: "Име Презиме",
        comment:
          "Коментар 1: Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга.",
        date: "00/00/00 00:00",
        imageAuthor: "./images/a0af269d50ae5839bea6f9f57815303c.jpg",
      },
    ],
    filter: "aktuelno",
    type: "video",
  },
  {
    id: "2",
    heading: "Картица 2",
    descriptionShort:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард...",
    descriptionLong:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "28/05/23",
    image: "./images/image2.jpg",
    video: "./videos/Jack Harlow - First Class.mp4",
    comments: [
      {
        author: "Име Презиме",
        comment:
          "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга.",
        date: "00/00/00 00:00",
        imageAuthor: "./images/a0af269d50ae5839bea6f9f57815303c.jpg",
      },
    ],
    filter: "safeblink",
    type: "video",
  },
  {
    id: "3",
    heading: "Картица 3",
    descriptionShort:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард...",
    descriptionLong:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "28/05/23",
    image: "./images/image3.jpg",
    video: "./videos/Jack Harlow - First Class.mp4",
    comments: [
      {
        author: "Име Презиме",
        comment:
          "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга.",
        date: "00/00/00 00:00",
        imageAuthor: "./images/a0af269d50ae5839bea6f9f57815303c.jpg",
      },
    ],
    filter: "najgledani",
    type: "video",
  },
  {
    id: "4",
    heading: "Картица 4",
    descriptionShort:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард...",
    descriptionLong:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "28/05/23",
    image: "./images/image4.jpg",
    video: "./videos/Jack Harlow - First Class.mp4",
    comments: [
      {
        author: "Име Презиме",
        comment:
          "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга.",
        date: "00/00/00 00:00",
        imageAuthor: "./images/a0af269d50ae5839bea6f9f57815303c.jpg",
      },
    ],
    filter: "najnovi",
    type: "video",
  },
  {
    id: "5",
    heading: "Картица 5",
    descriptionShort:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард...",
    descriptionLong:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "28/05/23",
    image: "./images/image5.jpg",
    video: "./videos/Jack Harlow - First Class.mp4",
    comments: [
      {
        author: "Име Презиме",
        comment:
          "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга.",
        date: "00/00/00 00:00",
        imageAuthor: "./images/a0af269d50ae5839bea6f9f57815303c.jpg",
      },
    ],
    filter: "najgledani",
    type: "video",
  },
  {
    id: "6",
    heading: "Картица 6",
    descriptionShort:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард...",
    descriptionLong:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "28/05/23",
    image: "./images/e3839e754d2b7fc980393331e0903a9b.jpg",
    video: "./videos/Jack Harlow - First Class.mp4",
    comments: [
      {
        author: "Име Презиме",
        comment:
          "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга.",
        date: "00/00/00 00:00",
        imageAuthor: "./images/a0af269d50ae5839bea6f9f57815303c.jpg",
      },
    ],
    filter: "safeblink",
    type: "video",
  },
];

if (!localStorage.getItem("discussions")) {
  localStorage.setItem("discussions", JSON.stringify(discussions));
}
if (!localStorage.getItem("users")) {
  localStorage.setItem("users", JSON.stringify(users));
}
if (!localStorage.getItem("content")) {
  localStorage.setItem("content", JSON.stringify(contentItems));
}
